import { GameData } from '../types/game.ts';

export const israeliData: GameData = {
  categories: [
    "אישים ישראלים",
    "צבא ובטחון",
    "אישים בספורט",
    "תרבות ושירה",
    "סמלי המדינה"
  ],
  questions: [
    // אישים ישראלים
    [
      {q: "מי היה ראש הממשלה הראשון של ישראל?", a: "דוד בן-גוריון", value: 100},
      {q: "על שם מי נקרא מכון ויצמן למדע?", a: "חיים ויצמן, הנשיא הראשון של מדינת ישראל", value: 200},
      {q: "מי הייתה ראשת הממשלה היחידה של ישראל?", a: "גולדה מאיר", value: 300},
      {q: "מי היה הסופר שזכה בפרס נובל לספרות?", a: "ש\"י עגנון", value: 400},
      {q: "מי היה המדען הישראלי שפיתח את שיטת הטפטפות?", a: "שמחה בלאס", value: 500}
    ],
    // צבא ובטחון
    [
      {q: "מהו צה''ל?", a: "צבא ההגנה לישראל", value: 100},
      {q: "מה שם המבצע לחילוץ יהודי אתיופיה?", a: "מבצע שלמה", value: 200},
      {q: "באיזה מבצע נחלץ יהונתן נתניהו?", a: "מבצע אנטבה (מבצע יונתן)", value: 300},
      {q: "מהו כינוי הצוללת הראשונה של חיל הים?", a: "דקר", value: 400},
      {q: "מי היה מפקד הפלמ''ח הראשון?", a: "יצחק שדה", value: 500}
    ],
    // אישים בספורט
    [
      {q: "מי זכה במדליית הזהב האולימפית הראשונה לישראל?", a: "גל פרידמן", value: 100},
      {q: "מי הביא את מדליית הזהב השנייה באולימפיאדה?", a: "ארטיום דולגופיאט", value: 200},
      {q: "איזו ספורטאית ישראלית זכתה באליפות אירופה בג'ודו?", a: "יעל ארד", value: 300},
      {q: "מי הכדורסלן הישראלי הראשון ב-NBA?", a: "עמרי כספי", value: 400},
      {q: "מי המתעמלת הישראלית שזכתה במדליית זהב באליפות אירופה?", a: "לינוי אשרם", value: 500}
    ],
    // תרבות ושירה
    [
      {q: "מי כתב את 'ירושלים של זהב'?", a: "נעמי שמר", value: 100},
      {q: "מי שר 'אני ואתה נשנה את העולם'?", a: "אריק איינשטיין", value: 200},
      {q: "מי כתב את הספר 'אצל הים'?", a: "עמוס עוז", value: 300},
      {q: "מי יצר את הסרט 'גבעת חלפון אינה עונה'?", a: "אסי דיין", value: 400},
      {q: "באיזה מחזמר ישראלי מפורסם כיכב יהורם גאון בתפקיד הראשי?", a: "קזבלן", value: 500}
    ],
    // סמלי המדינה
    [
      {q: "כמה כוכבים מופיעים בסמל המדינה?", a: "אין כוכבים בסמל המדינה", value: 100},
      {q: "מהו הפרח הלאומי של ישראל?", a: "כלנית", value: 200},
      {q: "מהי הציפור הלאומית של ישראל?", a: "דוכיפת", value: 300},
      {q: "מתי חוגגת הכנסת את יום הולדתה?", a: "ט״ו בשבט", value: 400},
      {q: "מה המקור לסמל המדינה?", a: "מנורת בית המקדש ועלי הזית", value: 500}
    ]
  ]
};